0.1.0/tutorials/incompressible/pimple/tjunction_fan/0.org/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      p;
}

dimensions      [m^2 s^-2];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            uniformTotalPressure;
    rho             none;
    psi             none;
    gamma           1;
    pressure        table
    2
    (
      (0 10)
      (1 40)
    )
    ;
    value           uniform 40;
  }
  outlet1
  {
    type            fixedValue;
    value           uniform 10;
  }
  outlet2
  {
    type            fixedValue;
    value           uniform 0;
  }
  defaultFaces
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
