0.1.0/tutorials/incompressible/pimple/tjunction_fan/0.org/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [m^2 s^-3];
internalField   uniform 200;

boundaryField
{
  inlet
  {
    type            turbulentMixingLengthDissipationRateInlet;
    mixingLength    0.01;
    phi             phi;
    k               k;
    value           uniform 200;
  }
  outlet1
  {
    type            inletOutlet;
    inletValue      uniform 200;
    value           uniform 200;
  }
  outlet2
  {
    type            inletOutlet;
    inletValue      uniform 200;
    value           uniform 200;
  }
  defaultFaces
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 200;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
