0.1.0/tutorials/incompressible/pimple/tjunction_fan/0.org/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [m^2 s^-1];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            calculated;
    value           uniform 0;
  }
  outlet1
  {
    type            calculated;
    value           uniform 0;
  }
  outlet2
  {
    type            calculated;
    value           uniform 0;
  }
  defaultFaces
  {
    type            nutkWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
